
/********************************
マトリクス
********************************/

var ary = new Array();

// ファンド名
ary["S01_01"] = "ファンド名称like";

// 運用会社
ary["S02_01"] = "運用会社=朝日ﾗｲﾌ";
ary["S02_02"] = "運用会社=ｱﾗｲｱﾝｽ";
ary["S02_03"] = "運用会社=ｲﾝﾍﾞｽｺ";
ary["S02_04"] = "運用会社=DIAM";
ary["S02_05"] = "運用会社=ｺﾞｰﾙﾄﾞﾏﾝ";
ary["S02_06"] = "運用会社=国際";
ary["S02_07"] = "運用会社=ｼｭﾛｰﾀﾞｰ";
ary["S02_08"] = "運用会社=新光";
ary["S02_09"] = "運用会社=新生";
ary["S02_10"] = "運用会社=ｽﾃｰﾄ";
ary["S02_11"] = "運用会社=ｽﾊﾟｰｸｽ";
ary["S02_12"] = "運用会社=住信AM";
ary["S02_13"] = "運用会社=ｿｼｴﾃ";
ary["S02_14"] = "運用会社=損保JPN";
ary["S02_15"] = "運用会社=大和";
ary["S02_16"] = "運用会社=大和住銀";
ary["S02_17"] = "運用会社=ﾄﾞｲﾁｪ";
ary["S02_18"] = "運用会社=東京海上";
ary["S02_19"] = "運用会社=ﾆｯｾｲ";
ary["S02_20"] = "運用会社=日興";
ary["S02_21"] = "運用会社=岡三";
ary["S02_22"] = "運用会社=野村";
ary["S02_23"] = "運用会社=BNP";
ary["S02_24"] = "運用会社=PCA";
ary["S02_25"] = "運用会社=ﾋﾟｸﾃ";
ary["S02_26"] = "運用会社=FCAM";
ary["S02_27"] = "運用会社=TAKMA";
ary["S02_28"] = "運用会社=ﾌｨﾃﾞﾘﾃｨ";
ary["S02_29"] = "運用会社=ﾌｫﾙﾃｨｽ";
ary["S02_30"] = "運用会社=ブラックロック";
ary["S02_31"] = "運用会社=ﾌﾟﾙﾃﾞﾝ";
ary["S02_32"] = "運用会社=ﾍﾞｱﾘﾝｸﾞ";
ary["S02_33"] = "運用会社=MHAM";
ary["S02_34"] = "運用会社=三井住友";
ary["S02_35"] = "運用会社=三菱UFJAM";
ary["S02_36"] = "運用会社=ﾓﾙｶﾞﾝS";
ary["S02_37"] = "運用会社=安田";
ary["S02_38"] = "運用会社=ﾕﾅｲﾃｯﾄﾞ";
ary["S02_39"] = "運用会社=ﾗｯｾﾙ";
ary["S02_40"] = "運用会社=楽天";
ary["S02_41"] = "運用会社=AIG";
ary["S02_42"] = "運用会社=HSBC";
ary["S02_43"] = "運用会社=JPモルガン";
ary["S02_44"] = "運用会社=T＆D";
ary["S02_45"] = "運用会社=ｱｸｻ";
ary["S02_45"] = "";
/*
'S02_46',   // 46   運用会社=ﾌﾟﾗｻﾞ
'S02_47',   // 47   運用会社=BNYメロン
'S02_48',   // 48   運用会社=MDAM
'S02_49',   // 49   運用会社=マニュライフ
'S02_50',   // 50   運用会社=MFS
'S02_51',   // 51   運用会社=フランクリン
'S02_52',   // 52   運用会社=アバディーン
'S02_53',   // 53   運用会社=トヨタ
'S02_54',   // 54   運用会社=中央三井
'S02_55',   // 55   運用会社=アムンディ         - new 20101104        
'S02_56',   // 56   運用会社=ばんせい           - new 20101104
'S02_57',   // 57   運用会社=パインブリッジ     - new 20101104
'S02_58',   // 58   運用会社=明治安田           - new 20101104
'S02_59',   // 59   運用会社=アイエヌ           - new 20101104
'S02_60'    // 60   運用会社=レッグ             - new 20101104    
*/

// 設定日
ary["S03_01"] = "設定日<=1999/12/31";
ary["S03_02"] = "設定日>=2000/01/01";
ary["S03_03"] = "設定日<=2005/12/31";
ary["S03_04"] = "設定日>=2006/01/01";

// 協会分類
ary["S04_01"] = "協会分類=ファンドオブファンズ";
ary["S04_02"] = "協会分類=株式投信追加型/インデックス型/ＴＯＰＩＸ連動型";
ary["S04_03"] = "協会分類=株式投信追加型/インデックス型/日経２２５連動型";
ary["S04_04"] = "協会分類=株式投信追加型/バランス型";
ary["S04_05"] = "協会分類=株式投信追加型/国際株式型/アジア・オセアニア型";
ary["S04_06"] = "協会分類=株式投信追加型/国際株式型/一般型";
ary["S04_07"] = "協会分類=株式投信追加型/国際株式型/欧州型";
ary["S04_08"] = "協会分類=株式投信追加型/国際株式型/北米型";
ary["S04_09"] = "協会分類=株式投信追加型/国際株式型/中南米型";
ary["S04_10"] = "協会分類=株式投信追加型/国内株式型/一般型";
ary["S04_11"] = "協会分類=株式投信追加型/国内株式型/中小型株型";
ary["S04_12"] = "協会分類=株式投信追加型/国内株式型/店頭株型";
ary["S04_13"] = "協会分類=株式投信追加型/転換社債型";
ary["S04_14"] = "協会分類=株式投信追加型/派生商品型";

// 純資産
ary["S05_01"] = "純資産（億円）>=";
ary["S05_02"] = "純資産（億円）<=";

// 手数料
ary["S06_01"] = "最大手数料!=0";
ary["S06_02"] = "最大手数料=0";

// 信託報酬
ary["S07_01"] = "信託報酬 合計<0.5";
ary["S07_02"] = "信託報酬 合計>=0.5";
ary["S07_03"] = "信託報酬 合計<1.0";
ary["S07_04"] = "信託報酬 合計>=1.0";

// 分配金
ary["S08_01"] = "分配方法=年1回";
ary["S08_02"] = "分配方法=年2回";
ary["S08_03"] = "分配方法=年4回";
ary["S08_04"] = "分配方法=隔月分配";
ary["S08_05"] = "分配方法=毎月分配";

// トータルリターン
ary["S09_01"] = "ﾘﾀｰﾝ(年率)6ヶ月like*";
ary["S09_02"] = "ﾘﾀｰﾝ(年率)6ヶ月<0";
ary["S09_03"] = "ﾘﾀｰﾝ(年率)6ヶ月>=0";
ary["S09_04"] = "ﾘﾀｰﾝ(年率)6ヶ月<10";
ary["S09_05"] = "ﾘﾀｰﾝ(年率)6ヶ月>=10";
ary["S09_06"] = "ﾘﾀｰﾝ(年率)6ヶ月<20";
ary["S09_07"] = "ﾘﾀｰﾝ(年率)6ヶ月>=20";
ary["S09_08"] = "ﾘﾀｰﾝ(年率)1年like*";
ary["S09_09"] = "ﾘﾀｰﾝ(年率)1年<0";
ary["S09_10"] = "ﾘﾀｰﾝ(年率)1年>=0";
ary["S09_11"] = "ﾘﾀｰﾝ(年率)1年<10";
ary["S09_12"] = "ﾘﾀｰﾝ(年率)1年>=10";
ary["S09_13"] = "ﾘﾀｰﾝ(年率)1年<20";
ary["S09_14"] = "ﾘﾀｰﾝ(年率)1年>=20";
ary["S09_15"] = "ﾘﾀｰﾝ(年率)2年like*";
ary["S09_16"] = "ﾘﾀｰﾝ(年率)2年<0";
ary["S09_17"] = "ﾘﾀｰﾝ(年率)2年>=0";
ary["S09_18"] = "ﾘﾀｰﾝ(年率)2年<10";
ary["S09_19"] = "ﾘﾀｰﾝ(年率)2年>=10";
ary["S09_20"] = "ﾘﾀｰﾝ(年率)2年<20";
ary["S09_21"] = "ﾘﾀｰﾝ(年率)2年>=20";
ary["S09_22"] = "ﾘﾀｰﾝ(年率)3年like*";
ary["S09_23"] = "ﾘﾀｰﾝ(年率)3年<0";
ary["S09_24"] = "ﾘﾀｰﾝ(年率)3年>=0";
ary["S09_25"] = "ﾘﾀｰﾝ(年率)3年<10";
ary["S09_26"] = "ﾘﾀｰﾝ(年率)3年>=10";
ary["S09_27"] = "ﾘﾀｰﾝ(年率)3年<20";
ary["S09_28"] = "ﾘﾀｰﾝ(年率)3年>=20";
ary["S09_29"] = "ﾘﾀｰﾝ(年率)5年like*";
ary["S09_30"] = "ﾘﾀｰﾝ(年率)5年<0";
ary["S09_31"] = "ﾘﾀｰﾝ(年率)5年>=0";
ary["S09_32"] = "ﾘﾀｰﾝ(年率)5年<10";
ary["S09_33"] = "ﾘﾀｰﾝ(年率)5年>=10";
ary["S09_34"] = "ﾘﾀｰﾝ(年率)5年<20";
ary["S09_35"] = "ﾘﾀｰﾝ(年率)5年>=20";

// シャープレシオ
ary["S10_01"] = "ｼｬｰﾌﾟﾚｼｵ6ヶ月like*";
ary["S10_02"] = "ｼｬｰﾌﾟﾚｼｵ6ヶ月<0";
ary["S10_03"] = "ｼｬｰﾌﾟﾚｼｵ6ヶ月>=0";
ary["S10_04"] = "ｼｬｰﾌﾟﾚｼｵ6ヶ月<1";
ary["S10_05"] = "ｼｬｰﾌﾟﾚｼｵ6ヶ月>=1";
ary["S10_06"] = "ｼｬｰﾌﾟﾚｼｵ6ヶ月<2";
ary["S10_07"] = "ｼｬｰﾌﾟﾚｼｵ6ヶ月>=2";
ary["S10_08"] = "ｼｬｰﾌﾟﾚｼｵ1年like*";
ary["S10_09"] = "ｼｬｰﾌﾟﾚｼｵ1年<0";
ary["S10_10"] = "ｼｬｰﾌﾟﾚｼｵ1年>=0";
ary["S10_11"] = "ｼｬｰﾌﾟﾚｼｵ1年<1";
ary["S10_12"] = "ｼｬｰﾌﾟﾚｼｵ1年>=1";
ary["S10_13"] = "ｼｬｰﾌﾟﾚｼｵ1年<2";
ary["S10_14"] = "ｼｬｰﾌﾟﾚｼｵ1年>=2";
ary["S10_15"] = "ｼｬｰﾌﾟﾚｼｵ2年like*";
ary["S10_16"] = "ｼｬｰﾌﾟﾚｼｵ2年<0";
ary["S10_17"] = "ｼｬｰﾌﾟﾚｼｵ2年>=0";
ary["S10_18"] = "ｼｬｰﾌﾟﾚｼｵ2年<1";
ary["S10_19"] = "ｼｬｰﾌﾟﾚｼｵ2年>=1";
ary["S10_20"] = "ｼｬｰﾌﾟﾚｼｵ2年<2";
ary["S10_21"] = "ｼｬｰﾌﾟﾚｼｵ2年>=2";
ary["S10_22"] = "ｼｬｰﾌﾟﾚｼｵ3年like*";
ary["S10_23"] = "ｼｬｰﾌﾟﾚｼｵ3年<0";
ary["S10_24"] = "ｼｬｰﾌﾟﾚｼｵ3年>=0";
ary["S10_25"] = "ｼｬｰﾌﾟﾚｼｵ3年<1";
ary["S10_26"] = "ｼｬｰﾌﾟﾚｼｵ3年>=1";
ary["S10_27"] = "ｼｬｰﾌﾟﾚｼｵ3年<2";
ary["S10_28"] = "ｼｬｰﾌﾟﾚｼｵ3年>=2";
ary["S10_29"] = "ｼｬｰﾌﾟﾚｼｵ5年like*";
ary["S10_30"] = "ｼｬｰﾌﾟﾚｼｵ5年<0";
ary["S10_31"] = "ｼｬｰﾌﾟﾚｼｵ5年>=0";
ary["S10_32"] = "ｼｬｰﾌﾟﾚｼｵ5年<1";
ary["S10_33"] = "ｼｬｰﾌﾟﾚｼｵ5年>=1";
ary["S10_34"] = "ｼｬｰﾌﾟﾚｼｵ5年<2";
ary["S10_35"] = "ｼｬｰﾌﾟﾚｼｵ5年>=2";

// レーティング（トータルリターン）
ary["S11_01"] = "LLｽｺｱ ﾄｰﾀﾙﾘﾀｰﾝ 3年=1";
ary["S11_02"] = "LLｽｺｱ ﾄｰﾀﾙﾘﾀｰﾝ 3年=2";
ary["S11_03"] = "LLｽｺｱ ﾄｰﾀﾙﾘﾀｰﾝ 3年=3";
ary["S11_04"] = "LLｽｺｱ ﾄｰﾀﾙﾘﾀｰﾝ 3年=4";
ary["S11_05"] = "LLｽｺｱ ﾄｰﾀﾙﾘﾀｰﾝ 3年=5";

// レーティング（リスク調整後リターン）
ary["S12_01"] = "LLｽｺｱ ﾘｽｸ調整 ﾘﾀｰﾝ 3年=1";
ary["S12_02"] = "LLｽｺｱ ﾘｽｸ調整 ﾘﾀｰﾝ 3年=2";
ary["S12_03"] = "LLｽｺｱ ﾘｽｸ調整 ﾘﾀｰﾝ 3年=3";
ary["S12_04"] = "LLｽｺｱ ﾘｽｸ調整 ﾘﾀｰﾝ 3年=4";
ary["S12_05"] = "LLｽｺｱ ﾘｽｸ調整 ﾘﾀｰﾝ 3年=5";

// レーティング（元本安定性）
ary["S13_01"] = "LLｽｺｱ 元本安定性 3年=1";
ary["S13_02"] = "LLｽｺｱ 元本安定性 3年=2";
ary["S13_03"] = "LLｽｺｱ 元本安定性 3年=3";
ary["S13_04"] = "LLｽｺｱ 元本安定性 3年=4";
ary["S13_05"] = "LLｽｺｱ 元本安定性 3年=5";

// レーティング（経費率）
ary["S14_01"] = "LLｽｺｱ 経費率 3年=1";
ary["S14_02"] = "LLｽｺｱ 経費率 3年=2";
ary["S14_03"] = "LLｽｺｱ 経費率 3年=3";
ary["S14_04"] = "LLｽｺｱ 経費率 3年=4";
ary["S14_05"] = "LLｽｺｱ 経費率 3年=5";

// キーワード
ary["S15_01"] = "キーワードlike";

// リッパー分類
ary["S16_01"] = "リッパー分類=コモディティ型";
ary["S16_02"] = "リッパー分類=ターゲットイヤー型";
ary["S16_03"] = "リッパー分類=マネー型　グローバル";
ary["S16_04"] = "リッパー分類=ミックスアセット　その他　バランス型";
ary["S16_05"] = "リッパー分類=ミックスアセット　その他　フレキシブル";
ary["S16_06"] = "リッパー分類=ミックスアセット　その他　安定型";
ary["S16_07"] = "リッパー分類=ミックスアセット　その他　積極型";
ary["S16_08"] = "リッパー分類=ミックスアセット　中国元　積極型";
ary["S16_09"] = "リッパー分類=ミックスアセット　日本円　バランス型";
ary["S16_10"] = "リッパー分類=ミックスアセット　日本円　安定型";
ary["S16_11"] = "リッパー分類=ミックスアセット　日本円　積極型";
ary["S16_12"] = "リッパー分類=ミックスアセット　米ドル　積極型";
ary["S16_13"] = "リッパー分類=株式型　アジアパシフィック";
ary["S16_14"] = "リッパー分類=株式型　アジアパシフィック　除日本";
ary["S16_15"] = "リッパー分類=株式型　インド株";
ary["S16_16"] = "リッパー分類=株式型　エマージングマーケット　グローバル";
ary["S16_17"] = "リッパー分類=株式型　エマージングマーケット　ラテンアメリカ";
ary["S16_18"] = "リッパー分類=株式型　エマージングマーケット　欧州";
ary["S16_19"] = "リッパー分類=株式型　エマージングマーケット　極東";
ary["S16_20"] = "リッパー分類=株式型　エマージングマーケット　その他";
ary["S16_21"] = "リッパー分類=株式型　グローバル";
ary["S16_22"] = "リッパー分類=株式型　グローバル　除日本";
ary["S16_23"] = "リッパー分類=株式型　ロシア株";
ary["S16_24"] = "リッパー分類=株式型　ブラジル株";
ary["S16_25"] = "リッパー分類=株式型　欧州株";
ary["S16_26"] = "リッパー分類=株式型　韓国株";
ary["S16_27"] = "リッパー分類=株式型　業種別　IT";
ary["S16_28"] = "リッパー分類=株式型　業種別　バイオ";
ary["S16_29"] = "リッパー分類=株式型　業種別　公益";
ary["S16_30"] = "リッパー分類=株式型　業種別　貴金属";
ary["S16_31"] = "リッパー分類=株式型　業種別　資源株";
ary["S16_32"] = "リッパー分類=株式型　業種別　非消費製品";
ary["S16_33"] = "リッパー分類=株式型　中国株";
ary["S16_34"] = "リッパー分類=株式型　日本株";
ary["S16_35"] = "リッパー分類=株式型　日本株　中小型株";
ary["S16_36"] = "リッパー分類=株式型　北米株";
ary["S16_37"] = "リッパー分類=株式型　北米株　中小型株";
ary["S16_38"] = "リッパー分類=債券型　アジアパシフィック";
ary["S16_39"] = "リッパー分類=債券型　エマージング　グローバル";
ary["S16_40"] = "リッパー分類=債券型　グローバル";
ary["S16_41"] = "リッパー分類=債券型　グローバル　円ヘッジ";
ary["S16_42"] = "リッパー分類=債券型　グローバル　短期債";
ary["S16_43"] = "リッパー分類=債券型　その他　インフレ連動";
ary["S16_44"] = "リッパー分類=債券型　ユーロ";
ary["S16_45"] = "リッパー分類=債券型　欧州";
ary["S16_46"] = "リッパー分類=債券型　豪ドル";
ary["S16_47"] = "リッパー分類=債券型　転社　日本";
ary["S16_48"] = "リッパー分類=債券型　日本円";
ary["S16_49"] = "リッパー分類=債券型　米ドル";
ary["S16_50"] = "リッパー分類=債券型　米ドル　ハイイールド";
ary["S16_51"] = "リッパー分類=債券型　米ドル　社債";
ary["S16_52"] = "リッパー分類=不動産型　グローバル";
ary["S16_53"] = "リッパー分類=不動産型　欧州";
ary["S16_54"] = "リッパー分類=不動産型　日本";
ary["S16_55"] = "リッパー分類=不動産型　北米";
ary["S16_56"] = "リッパー分類=不動産型　その他";
ary["S16_57"] = "リッパー分類=非分類";
ary["S16_58"] = "リッパー分類=株式型　オーストラレーシア";

// アセットタイプ
ary["S17_01"] = "アセットタイプ2=国内株式";
ary["S17_02"] = "アセットタイプ2=海外株式";
ary["S17_03"] = "アセットタイプ2=国内債券";
ary["S17_04"] = "アセットタイプ2=海外債券";
ary["S17_05"] = "アセットタイプ2=国内不動産";
ary["S17_06"] = "アセットタイプ2=海外不動産";
ary["S17_07"] = "アセットタイプ2=ミックスアセット";
ary["S17_08"] = "アセットタイプ2=その他";

// 投資地域
ary["S18_01"] = "投資地域(ファンド)=日本";
ary["S18_02"] = "投資地域(ファンド)=ｱｼﾞｱ･ｵｾｱﾆｱ";
ary["S18_03"] = "投資地域(ファンド)=ｴﾏｰｼﾞﾝｸﾞ";
ary["S18_04"] = "投資地域(ファンド)=ｸﾞﾛｰﾊﾞﾙ";
ary["S18_05"] = "投資地域(ファンド)=欧州";
ary["S18_06"] = "投資地域(ファンド)=北米";

// テーマ
ary["S19_01"] = "テーマlike*ｲﾝﾃﾞｯｸｽ型*";
ary["S19_02"] = "テーマlike*ﾌｧﾝﾄﾞｵﾌﾞﾌｫﾝｽﾞ*";
ary["S19_03"] = "テーマlike*中小型株*";
ary["S19_04"] = "テーマlike*業種･ﾃｰﾏ型*";
ary["S19_05"] = "テーマlike*BRICs*";
ary["S19_06"] = "テーマlike*REIT*";

// ベンチマーク（グループ）
ary["S20_01"] = "ベンチマーク(グループ)=ｼﾃｨｸﾞﾙｰﾌﾟ";
ary["S20_02"] = "ベンチマーク(グループ)=ﾀﾞｳｼﾞｮｰﾝｽﾞ";
ary["S20_03"] = "ベンチマーク(グループ)=ﾒﾘﾙﾘﾝﾁ";
ary["S20_04"] = "ベンチマーク(グループ)=ﾗｯｾﾙ";
ary["S20_05"] = "ベンチマーク(グループ)=ﾘｰﾏﾝ";
ary["S20_06"] = "ベンチマーク(グループ)=日経";
ary["S20_07"] = "ベンチマーク(グループ)=東証";
ary["S20_08"] = "ベンチマーク(グループ)=FTSE";
ary["S20_09"] = "ベンチマーク(グループ)=JASDAQ";
ary["S20_10"] = "ベンチマーク(グループ)=JPﾓﾙｶﾞﾝ";
ary["S20_11"] = "ベンチマーク(グループ)=MSCI";
ary["S20_12"] = "ベンチマーク(グループ)=S＆P";
ary["S20_13"] = "ベンチマーク(グループ)=その他";
ary["S20_14"] = "ベンチマーク(グループ)=未設定";

// ベンチマーク
ary["S21_01"] = "ベンチマーク=ｼﾃｨｸﾞﾙｰﾌﾟ ｱﾒﾘｶ国債指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_02"] = "ベンチマーク=ｼﾃｨｸﾞﾙｰﾌﾟ ｵｰｽﾄﾗﾘｱ国債指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_03"] = "ベンチマーク=ｼﾃｨｸﾞﾙｰﾌﾟ ﾕｰﾛBIG債券指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_04"] = "ベンチマーク=ｼﾃｨｸﾞﾙｰﾌﾟ 世界国債指数 (ﾄﾞﾙ建) ｢配当込｣__LT__円換算__GT__";
ary["S21_05"] = "ベンチマーク=シティグループ 世界国債指数(円ヘッジ) 「配当込」";
ary["S21_06"] = "ベンチマーク=ｼﾃｨｸﾞﾙｰﾌﾟ 世界国債指数(1年-3年) ｢配当込｣__LT__円換算__GT__";
ary["S21_07"] = "ベンチマーク=ｼﾃｨｸﾞﾙｰﾌﾟ 日本国債指数 ｢配当込｣";
ary["S21_08"] = "ベンチマーク=ｼﾃｨｸﾞﾙｰﾌﾟ 欧州世界国債指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_09"] = "ベンチマーク=ｼﾞｬｽﾀﾞｯｸ指数";
ary["S21_10"] = "ベンチマーク=ﾀﾞｳｼﾞｮｰﾝｽﾞ Stoxx 50__LT__円換算__GT__";
ary["S21_11"] = "ベンチマーク=ﾎﾞﾝﾍﾞｲ 100__LT__円換算__GT__";
ary["S21_12"] = "ベンチマーク=ボベスパ指数__LT__円換算__GT__";
ary["S21_13"] = "ベンチマーク=ﾒﾘﾙﾘﾝﾁ ｸﾞﾛｰﾊﾞﾙｴﾏｰｼﾞﾝｸﾞｿﾌﾞﾘﾝ指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_14"] = "ベンチマーク=ﾒﾘﾙﾘﾝﾁ USﾊｲｲｰﾙﾄﾞ指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_15"] = "ベンチマーク=ﾗｯｾﾙ2000 ｢配当込｣__LT__円換算__GT__";
ary["S21_16"] = "ベンチマーク=ﾘｰﾏﾝ･ﾌﾞﾗｻﾞｰｽﾞ･US･ｺｰﾎﾟﾚｰﾄ･ﾊｲ･ｲｰﾙﾄﾞ指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_17"] = "ベンチマーク=ﾛｼｱ ﾓｽｸﾜﾀｲﾑｽﾞ__LT__円換算__GT__";
ary["S21_18"] = "ベンチマーク=日経225";
ary["S21_19"] = "ベンチマーク=東証第2部株価指数";
ary["S21_20"] = "ベンチマーク=東証REIT指数";
ary["S21_21"] = "ベンチマーク=韓国KOSPI指数__LT__円換算__GT__";
ary["S21_22"] = "ベンチマーク=FTSE AW/ｵｲﾙ･ｶﾞｽ ｢配当込｣__LT__円換算__GT__";
ary["S21_23"] = "ベンチマーク=FTSE AW/ﾃｸﾉﾛｼﾞｰ ｢配当込｣__LT__円換算__GT__";
ary["S21_24"] = "ベンチマーク=FTSE AW/公益 ｢配当込｣__LT__円換算__GT__";
ary["S21_25"] = "ベンチマーク=FTSE AW/鉱業 ｢配当込｣__LT__円換算__GT__";
ary["S21_26"] = "ベンチマーク=FTSE EPRA/NAREIT 米国 ｢配当込｣__LT__円換算__GT__";
ary["S21_27"] = "ベンチマーク=FTSE EPRA/NAREIT ｱｼﾞｱ｢配当込｣__LT__円換算__GT__";
ary["S21_28"] = "ベンチマーク=FTSE EPRA/NAREIT ｸﾞﾛｰﾊﾞﾙ ｢配当込｣__LT__円換算__GT__";
ary["S21_29"] = "ベンチマーク=FTSE EPRA/NAREIT ﾖｰﾛｯﾊﾟ ｢配当込｣__LT__円換算__GT__";
ary["S21_30"] = "ベンチマーク=JPﾓﾙｶﾞﾝ ｸﾞﾛｰﾊﾞﾙﾏﾈｰﾏｰｹｯﾄ3ヶ月__LT__円換算__GT__";
ary["S21_31"] = "ベンチマーク=JPﾓﾙｶﾞﾝ EMBI+ ｱｼﾞｱ 指数__LT__円換算__GT__";
ary["S21_32"] = "ベンチマーク=Jefferies Active Convertible Japan";
ary["S21_33"] = "ベンチマーク=MSCI ｱﾗﾋﾞｱﾝﾏｰｹｯﾄ指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_34"] = "ベンチマーク=MSCI ｴﾏｰｼﾞﾝｸﾞ ﾌｧｰ･ｲｰｽﾄ ｢配当込｣__LT__円換算__GT__";
ary["S21_35"] = "ベンチマーク=MSCI ｴﾏｰｼﾞﾝｸﾞ ﾗﾃﾝｱﾒﾘｶ ｢配当込｣__LT__円換算__GT__";
ary["S21_36"] = "ベンチマーク=MSCI ｴﾏｰｼﾞﾝｸﾞ 東欧 ｢配当込｣__LT__円換算__GT__";
ary["S21_37"] = "ベンチマーク=MSCI ｴﾏｰｼﾞﾝｸﾞ･ﾏｰｹｯﾄ ｢配当込｣__LT__円換算__GT__";
ary["S21_38"] = "ベンチマーク=MSCI ﾁｬｲﾅ指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_39"] = "ベンチマーク=MSCI ｺｸｻｲ指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_40"] = "ベンチマーク=MSCI ﾜｰﾙﾄﾞ/ﾊﾞｲｵﾃｸﾉﾛｼﾞｰ ｢配当込｣__LT__円換算__GT__";
ary["S21_41"] = "ベンチマーク=MSCI ﾜｰﾙﾄﾞ/消費財｢配当込｣__LT__円換算__GT__";
ary["S21_42"] = "ベンチマーク=MSCI 世界株価指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_43"] = "ベンチマーク=MSCI AC ｱｼﾞｱ･ﾊﾟｼﾌｨｯｸ ｢配当込｣__LT__円換算__GT__";
ary["S21_44"] = "ベンチマーク=MSCI AC ｱｼﾞｱ･ﾊﾟｼﾌｨｯｸ(除日本) ｢配当込｣__LT__円換算__GT__";
ary["S21_45"] = "ベンチマーク=MSCI BRICs指数 ｢配当込｣__LT__円換算__GT__";
ary["S21_46"] = "ベンチマーク=S__AMP__P GSCI商品指数｢配当込｣__LT__円換算__GT__";
ary["S21_47"] = "ベンチマーク=S__AMP__P500 ｢配当込｣__LT__円換算__GT__";
ary["S21_48"] = "ベンチマーク=TOPIX ｢配当込｣";
ary["S21_49"] = "ベンチマーク=未設定";

// 積立サービス対象銘柄
ary["S22_01"] = "積立フラグ=1";
ary["S22_02"] = "積立フラグ!=1";
// 分配金再投資コース
ary["S23_01"] = "再投資フラグ=1";
ary["S23_02"] = "再投資フラグ!=1";
// suishouFlag
ary["S24_01"] = "suishouFlag=1";
ary["S24_02"] = "suishouFlag!=1";

var myVars = location.search.substr(1);

myVars = decodeURIComponent(myVars);

for(var i in ary){
    myVars = myVars.replace(i, ary[i]);
}

//var so = new SWFObject("swfファイル名","id","width","height","Playerバージョン","背景色");
var so = new SWFObject("matrix.swf", "matrix", "550", "350", "8", "#000000");
so.addParam("quality", "high");     //so.addParam("paramタグのname属性","paramタグのvalue属性");
so.addParam("menu", "false");       //so.addParam("paramタグのname属性","paramタグのvalue属性");
so.addParam("flashvars", myVars);   //so.addParam("paramタグのname属性","paramタグのvalue属性");
so.write("flash_matrix");           //so.write("Flashを表示するdivタグのid");